# SQL Cheatsheet with Expanded Functions

## Import Libraries and Connect to Database

In [ ]:

import sqlite3
import pandas as pd

# Connect to SQLite database
conn = sqlite3.connect('example.db')
cursor = conn.cursor()

## Create Tables

In [ ]:

# Create a new table
cursor.execute('''
CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    department TEXT,
    salary REAL
)
''')
conn.commit()

## Insert Data

In [ ]:

# Insert data into the table
cursor.execute("INSERT INTO employees (name, age, department, salary) VALUES ('Alice', 30, 'HR', 50000)")
cursor.execute("INSERT INTO employees (name, age, department, salary) VALUES ('Bob', 25, 'Engineering', 60000)")
cursor.execute("INSERT INTO employees (name, age, department, salary) VALUES ('Charlie', 35, 'Finance', 70000)")
conn.commit()

## Query Data

In [ ]:

# Query data from the table
cursor.execute("SELECT * FROM employees")
rows = cursor.fetchall()
for row in rows:
    print(row)

## Update Data

In [ ]:

# Update data in the table
cursor.execute("UPDATE employees SET salary = 65000 WHERE name = 'Bob'")
conn.commit()

## Delete Data

In [ ]:

# Delete data from the table
cursor.execute("DELETE FROM employees WHERE name = 'Charlie'")
conn.commit()

## Aggregate Functions

In [ ]:

# Count the number of employees
cursor.execute("SELECT COUNT(*) FROM employees")
count = cursor.fetchone()[0]
print("Number of employees:", count)

# Calculate the average salary
cursor.execute("SELECT AVG(salary) FROM employees")
avg_salary = cursor.fetchone()[0]
print("Average salary:", avg_salary)

# Find the maximum salary
cursor.execute("SELECT MAX(salary) FROM employees")
max_salary = cursor.fetchone()[0]
print("Maximum salary:", max_salary)

## Group By

In [ ]:

# Group by department and calculate average salary
cursor.execute("SELECT department, AVG(salary) FROM employees GROUP BY department")
rows = cursor.fetchall()
for row in rows:
    print(row)

## Join Tables

In [ ]:

# Create another table
cursor.execute('''
CREATE TABLE IF NOT EXISTS departments (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    manager TEXT
)
''')
cursor.execute("INSERT INTO departments (name, manager) VALUES ('HR', 'John')")
cursor.execute("INSERT INTO departments (name, manager) VALUES ('Engineering', 'Jane')")
cursor.execute("INSERT INTO departments (name, manager) VALUES ('Finance', 'Emily')")
conn.commit()

# Join the two tables
cursor.execute('''
SELECT employees.name, employees.department, departments.manager
FROM employees
JOIN departments ON employees.department = departments.name
''')
rows = cursor.fetchall()
for row in rows:
    print(row)

## Subqueries

In [ ]:

# Subquery to find employees with salary above the average
cursor.execute('''
SELECT name, salary FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees)
''')
rows = cursor.fetchall()
for row in rows:
    print(row)

## Indexing

In [ ]:

# Create an index on the salary column
cursor.execute("CREATE INDEX IF NOT EXISTS idx_salary ON employees (salary)")
conn.commit()

## Transactions

In [ ]:

# Begin a transaction
conn.execute('BEGIN TRANSACTION')
try:
    cursor.execute("INSERT INTO employees (name, age, department, salary) VALUES ('David', 40, 'HR', 55000)")
    cursor.execute("UPDATE employees SET salary = 58000 WHERE name = 'Alice'")
    conn.commit()
except Exception as e:
    conn.rollback()
    print("Transaction failed:", e)

## Views

In [ ]:

# Create a view
cursor.execute('''
CREATE VIEW IF NOT EXISTS high_salary_employees AS
SELECT name, salary FROM employees WHERE salary > 55000
''')

# Query the view
cursor.execute("SELECT * FROM high_salary_employees")
rows = cursor.fetchall()
for row in rows:
    print(row)

## Closing the Connection

In [ ]:

# Close the database connection
conn.close()